imports

In [33]:
import pandas as pd
import numpy as np
import statsmodels.api as sm

Creating dataset

In [2]:
data = {'Name': ["Simson", "Anna", "Peter", "Linda", "Maria", "Daniel", "Simon", "Monica"],
        'Profession':["Data Analyst", "Steward", "Refree", "Mechanic", "Pilot", "Nurse", "Police officer", "Doctor"],
        'Age':[28, 25, np.nan, 32, 55, np.nan, 59, np.nan],
        'Country':["Namibia", "South Africa", "USA", "Canada", "Nigeria", "Germany", "Germany", "Portugal"]}

df = pd.DataFrame(data)

saving dataset into a csv file

In [3]:
df.to_csv("Missing values.csv", index=False)

reading the csv

In [4]:
pd.read_csv('Missing values.csv')

     Name      Profession   Age       Country
0  Simson    Data Analyst  28.0       Namibia
1    Anna         Steward  25.0  South Africa
2   Peter          Refree   NaN           USA
3   Linda        Mechanic  32.0        Canada
4   Maria           Pilot  55.0       Nigeria
5  Daniel           Nurse   NaN       Germany
6   Simon  Police officer  59.0       Germany
7  Monica          Doctor   NaN      Portugal

This section is to check if we have any missing values in the dataset

In [5]:
df.describe()

             Age
count   5.000000
mean   39.800000
std    15.959323
min    25.000000
25%    28.000000
50%    32.000000
75%    55.000000
max    59.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Profession  8 non-null      object
 2   Age         5 non-null      float64
 3   Country     8 non-null      object
dtypes: float64(1), object(3)
memory usage: 384.0+ bytes

In [7]:
df.isnull()

    Name  Profession    Age  Country
0  False       False  False    False
1  False       False  False    False
2  False       False   True    False
3  False       False  False    False
4  False       False  False    False
5  False       False   True    False
6  False       False  False    False
7  False       False   True    False

How to check if we have any null value in the dataset

In [8]:
df.isnull().values.any()

np.True_

How to count how many NULL values we have

In [9]:
df.isnull().sum().sum()

np.int64(3)

How to count how many NULL values we have per column

In [10]:
df.isnull().sum()

Name          0
Profession    0
Age           3
Country       0
dtype: int64

In [11]:
df.isnull().any(axis=1)

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7     True
dtype: bool

dealing with missing data

In [12]:
df.dropna(axis=1, how="all")
df.dropna(axis=0, how="all")

     Name      Profession   Age       Country
0  Simson    Data Analyst  28.0       Namibia
1    Anna         Steward  25.0  South Africa
2   Peter          Refree   NaN           USA
3   Linda        Mechanic  32.0        Canada
4   Maria           Pilot  55.0       Nigeria
5  Daniel           Nurse   NaN       Germany
6   Simon  Police officer  59.0       Germany
7  Monica          Doctor   NaN      Portugal

In [13]:
df.drop_duplicates()

     Name      Profession   Age       Country
0  Simson    Data Analyst  28.0       Namibia
1    Anna         Steward  25.0  South Africa
2   Peter          Refree   NaN           USA
3   Linda        Mechanic  32.0        Canada
4   Maria           Pilot  55.0       Nigeria
5  Daniel           Nurse   NaN       Germany
6   Simon  Police officer  59.0       Germany
7  Monica          Doctor   NaN      Portugal

In [14]:
df[df["Age"].notnull()]

     Name      Profession   Age       Country
0  Simson    Data Analyst  28.0       Namibia
1    Anna         Steward  25.0  South Africa
3   Linda        Mechanic  32.0        Canada
4   Maria           Pilot  55.0       Nigeria
6   Simon  Police officer  59.0       Germany

Filling NULL values

In [15]:
df.fillna(0)
df.fillna(df["Age"].median())
df.fillna(df["Age"].mean())
df.fillna(df["Age"].mode())

     Name      Profession   Age       Country
0  Simson    Data Analyst  28.0       Namibia
1    Anna         Steward  25.0  South Africa
2   Peter          Refree   NaN           USA
3   Linda        Mechanic  32.0        Canada
4   Maria           Pilot  55.0       Nigeria
5  Daniel           Nurse   NaN       Germany
6   Simon  Police officer  59.0       Germany
7  Monica          Doctor   NaN      Portugal

In [16]:
df["Age"].ffill() #fff means forward fill

0    28.0
1    25.0
2    25.0
3    32.0
4    55.0
5    55.0
6    59.0
7    59.0
Name: Age, dtype: float64

In [17]:
df["Age"].bfill() #Backward fill

0    28.0
1    25.0
2    32.0
3    32.0
4    55.0
5    59.0
6    59.0
7     NaN
Name: Age, dtype: float64

In [18]:
df["Age"].interpolate()

0    28.0
1    25.0
2    28.5
3    32.0
4    55.0
5    57.0
6    59.0
7    59.0
Name: Age, dtype: float64

Checking for datatypes

In [19]:
df.dtypes

Name           object
Profession     object
Age           float64
Country        object
dtype: object

In [20]:
df.describe()

             Age
count   5.000000
mean   39.800000
std    15.959323
min    25.000000
25%    28.000000
50%    32.000000
75%    55.000000
max    59.000000

In [21]:
df["Country"].apply(type).value_counts()

Country
<class 'str'>    8
Name: count, dtype: int64

Identiying if we have outliers and Anomalies

1. Using a range
2. Z-score
3. IQR
4. IsolationForest

In [22]:
# Using ranges
df["Range"] = df["Age"].apply(lambda age: -1 if age<18 or age>65 else "")

In [23]:
# Using Z-score
df["Z-score"] = (df["Age"] - df["Age"].mean())/df["Age"].std()
df["Z-score"] = df["Z-score"].apply(lambda value: "x" if value<-2 or value>2 else "")

In [24]:
# Using IQR

Q1 = df["Age"].quantile(q=0.25)
Q3 = df["Age"].quantile(q=0.75)
IQR = Q3 - Q1
print(IQR)

27.0

In [25]:
# Calculating the lower bound
lower_bound = Q1 - 1.5*IQR
print(lower_bound)

# Calculating the upper bound
upper_bound = Q3 - 1.5*IQR
print(upper_bound)

-12.5
14.5

In [26]:
# Getting of IQR 
df["IQR"] = df["Age"].apply(lambda age: -1 if age<lower_bound or age>upper_bound else "")

In [27]:
# Using Isolation Forest
from sklearn.ensemble import IsolationForest as IS

In [28]:
model = IS(contamination="auto")
df["IsolationForest"] = model.fit_predict(df[["Age"]])

Handling Outliers after Identifying them

In [29]:
# Deleting
df.query("Age>=18 and Age<=65")

,Name,Profession,Age,Country,Range,Z-score,IQR,IsolationForest
0,Simson,Data Analyst,28.0,Namibia,,,-1,-1
1,Anna,Steward,25.0,South Africa,,,-1,-1
3,Linda,Mechanic,32.0,Canada,,,-1,-1
4,Maria,Pilot,55.0,Nigeria,,,-1,-1
6,Simon,Police officer,59.0,Germany,,,-1,1

In [ ]:
# Correcting the outliers
df["Age"].apply(lambda x: min(x, 65))

0    28.0
1    25.0
2     NaN
3    32.0
4    55.0
5     NaN
6    59.0
7     NaN
Name: Age, dtype: float64

In [1]:
%pip install statsmodels

import statsmodels.api as sm

Requirement already satisfied: statsmodels in c:\users\maxnd\appdata\local\programs\python\python310\lib\site-packages (0.14.4)
Requirement already satisfied: numpy<3,>=1.22.3 in c:\users\maxnd\appdata\local\programs\python\python310\lib\site-packages (from statsmodels) (2.1.3)
Requirement already satisfied: scipy!=1.9.2,>=1.8 in c:\users\maxnd\appdata\local\programs\python\python310\lib\site-packages (from statsmodels) (1.15.3)
Requirement already satisfied: pandas!=2.1.0,>=1.4 in c:\users\maxnd\appdata\local\programs\python\python310\lib\site-packages (from statsmodels) (2.2.3)
Requirement already satisfied: patsy>=0.5.6 in c:\users\maxnd\appdata\local\programs\python\python310\lib\site-packages (from statsmodels) (1.0.1)
Requirement already satisfied: packaging>=21.3 in c:\users\maxnd\appdata\local\programs\python\python310\lib\site-packages (from statsmodels) (24.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\maxnd\appdata\local\programs\python\python310\lib\site-packages (from pandas!=2.1.0,>=1.4->statsmodels) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\maxnd\appdata\local\programs\python\python310\lib\site-packages (from pandas!=2.1.0,>=1.4->statsmodels) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\maxnd\appdata\local\programs\python\python310\lib\site-packages (from pandas!=2.1.0,>=1.4->statsmodels) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\maxnd\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.2->pandas!=2.1.0,>=1.4->statsmodels) (1.17.0)
Note: you may need to restart the kernel to use updated packages.